#pragma once
//---------------------------------------------------------------------------
#ifndef VipBaseH
#define VipBaseH
//---------------------------------------------------------------------------
//#include <string>	// Для использования std::string
//#include "TextManager.h"
//---------------------------------------------------------------------------
// Класс для работы с базами
//---------------------------------------------------------------------------
class VipBase
{
protected:

private:

public:
	VipBase(void);	// Конструктор класса
	~VipBase();		// Деструктор класса

	// Переменные
//	std::string File;	// Путь к файлу с логом
	
	// Функции
//	void CreateBaseDir(std::wstring BaseDir, std::wstring OurRef);	// Создание директорий в зависимости от типа базы
	void CreateBaseDir(System::String^ BaseDir, System::String^ OurRef);	// Создание директорий в зависимости от типа базы

};
#endif
//---------------------------------------------------------------------------